In [1]:
# DATAFRAME

In [2]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [3]:
df= pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A -0.083226  1.559589 -0.389440 -0.864296
B  0.544566 -0.025941 -0.002299  0.418793
C -0.195094 -1.004272  0.781975 -1.773175
D  0.600177  0.161532 -0.743024  1.232517
E -1.489418 -2.065437 -0.548158 -0.715666

In [4]:
df['W']

A   -0.083226
B    0.544566
C   -0.195094
D    0.600177
E   -1.489418
Name: W, dtype: float64

In [5]:
# pass a list of column names

df[['W','Z']]

          W         Z
A -0.083226 -0.864296
B  0.544566  0.418793
C -0.195094 -1.773175
D  0.600177  1.232517
E -1.489418 -0.715666

In [6]:
type(df['W'])

pandas.core.series.Series

In [7]:
#creating new column:**

df['new']=df['W']+df['Y']
df

          W         X         Y         Z       new
A -0.083226  1.559589 -0.389440 -0.864296 -0.472665
B  0.544566 -0.025941 -0.002299  0.418793  0.542267
C -0.195094 -1.004272  0.781975 -1.773175  0.586882
D  0.600177  0.161532 -0.743024  1.232517 -0.142847
E -1.489418 -2.065437 -0.548158 -0.715666 -2.037576

In [8]:
#** removing columns**
df.drop('new',axis=1)

          W         X         Y         Z
A -0.083226  1.559589 -0.389440 -0.864296
B  0.544566 -0.025941 -0.002299  0.418793
C -0.195094 -1.004272  0.781975 -1.773175
D  0.600177  0.161532 -0.743024  1.232517
E -1.489418 -2.065437 -0.548158 -0.715666

In [9]:
df.drop('E',axis=0)

          W         X         Y         Z       new
A -0.083226  1.559589 -0.389440 -0.864296 -0.472665
B  0.544566 -0.025941 -0.002299  0.418793  0.542267
C -0.195094 -1.004272  0.781975 -1.773175  0.586882
D  0.600177  0.161532 -0.743024  1.232517 -0.142847

In [10]:
#** selecting rows**
df.loc['A']

W     -0.083226
X      1.559589
Y     -0.389440
Z     -0.864296
new   -0.472665
Name: A, dtype: float64

In [11]:
# or select based off pf position instead of label

df.iloc[2]

W     -0.195094
X     -1.004272
Y      0.781975
Z     -1.773175
new    0.586882
Name: C, dtype: float64

In [12]:
# ** selecting subset of rows and colomns**
df.loc['B','Y']

-0.00229866105144923

In [13]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.083226 -0.389440
B  0.544566 -0.002299

In [14]:
#bconditionalselection
#
#an important future of pandas is conditional selection using brackets notation, very similar to numpy:

df

          W         X         Y         Z       new
A -0.083226  1.559589 -0.389440 -0.864296 -0.472665
B  0.544566 -0.025941 -0.002299  0.418793  0.542267
C -0.195094 -1.004272  0.781975 -1.773175  0.586882
D  0.600177  0.161532 -0.743024  1.232517 -0.142847
E -1.489418 -2.065437 -0.548158 -0.715666 -2.037576

In [15]:
df>0

       W      X      Y      Z    new
A  False   True  False  False  False
B   True  False  False   True   True
C  False  False   True  False   True
D   True   True  False   True  False
E  False  False  False  False  False

In [16]:
df[df>0]

          W         X         Y         Z       new
A       NaN  1.559589       NaN       NaN       NaN
B  0.544566       NaN       NaN  0.418793  0.542267
C       NaN       NaN  0.781975       NaN  0.586882
D  0.600177  0.161532       NaN  1.232517       NaN
E       NaN       NaN       NaN       NaN       NaN

In [17]:
df[df['W']>2]

Empty DataFrame
Columns: [W, X, Y, Z, new]
Index: []

In [18]:
df[df['W']>0]['Y']

B   -0.002299
D   -0.743024
Name: Y, dtype: float64

In [19]:
# for two conditions you can use | and & with paranthesis:

df[(df['W']>0)&(df['Y']>1)]

Empty DataFrame
Columns: [W, X, Y, Z, new]
Index: []

In [20]:
df

          W         X         Y         Z       new
A -0.083226  1.559589 -0.389440 -0.864296 -0.472665
B  0.544566 -0.025941 -0.002299  0.418793  0.542267
C -0.195094 -1.004272  0.781975 -1.773175  0.586882
D  0.600177  0.161532 -0.743024  1.232517 -0.142847
E -1.489418 -2.065437 -0.548158 -0.715666 -2.037576

In [21]:
#reset to default 0,1....n index

df.reset_index()

  index         W         X         Y         Z       new
0     A -0.083226  1.559589 -0.389440 -0.864296 -0.472665
1     B  0.544566 -0.025941 -0.002299  0.418793  0.542267
2     C -0.195094 -1.004272  0.781975 -1.773175  0.586882
3     D  0.600177  0.161532 -0.743024  1.232517 -0.142847
4     E -1.489418 -2.065437 -0.548158 -0.715666 -2.037576

In [22]:
newind='CA NY WY OR CO'.split()
df['states']= newind
df

          W         X         Y         Z       new states
A -0.083226  1.559589 -0.389440 -0.864296 -0.472665     CA
B  0.544566 -0.025941 -0.002299  0.418793  0.542267     NY
C -0.195094 -1.004272  0.781975 -1.773175  0.586882     WY
D  0.600177  0.161532 -0.743024  1.232517 -0.142847     OR
E -1.489418 -2.065437 -0.548158 -0.715666 -2.037576     CO

In [23]:
df. set_index('states',inplace=True)
df

               W         X         Y         Z       new
states
CA     -0.083226  1.559589 -0.389440 -0.864296 -0.472665
NY      0.544566 -0.025941 -0.002299  0.418793  0.542267
WY     -0.195094 -1.004272  0.781975 -1.773175  0.586882
OR      0.600177  0.161532 -0.743024  1.232517 -0.142847
CO     -1.489418 -2.065437 -0.548158 -0.715666 -2.037576

In [24]:
# ## multi-index abd index hierarchy 
# index levels
outside =['G1','G1','G1','G2','G2','G2']
inside= [1,2,3,1,2,3]
heir_index= list(zip(outside,inside))
heir_index= pd.MultiIndex.from_tuples(heir_index)

In [25]:
heir_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [26]:
df= pd.DataFrame(np.random.randn(6,2),index=heir_index,columns=['A','B'])
df

             A         B
G1 1 -0.285370 -1.320604
   2 -0.715855 -0.617920
   3  0.627198  0.618185
G2 1 -0.153526  0.237038
   2  0.764586  1.280838
   3 -0.951744  0.644778

In [27]:
df.loc['G1']

          A         B
1 -0.285370 -1.320604
2 -0.715855 -0.617920
3  0.627198  0.618185

In [28]:
df.loc['G1'].loc[1]

A   -0.285370
B   -1.320604
Name: 1, dtype: float64

In [29]:
df.index.names

FrozenList([None, None])

In [30]:
df.index.names=['Group','Num']
df

                  A         B
Group Num
G1    1   -0.285370 -1.320604
      2   -0.715855 -0.617920
      3    0.627198  0.618185
G2    1   -0.153526  0.237038
      2    0.764586  1.280838
      3   -0.951744  0.644778

In [31]:
# xs function return the specified portion from the dataframe
# here the function returns the value from the index'G1'
df.xs('G1')

            A         B
Num
1   -0.285370 -1.320604
2   -0.715855 -0.617920
3    0.627198  0.618185

In [32]:
df.xs(['G1',1])

C:\Users\USER\AppData\Local\Temp\ipykernel_5388\580597333.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(['G1',1])

A   -0.285370
B   -1.320604
Name: (G1, 1), dtype: float64

In [33]:
df.xs(1,level='Num')

              A         B
Group
G1    -0.285370 -1.320604
G2    -0.153526  0.237038

In [34]:
# SERIES

In [35]:
# ## creating a series
# you can convert  a list,numpy array, or dictionary to a series:
 
    
labels=['a','b','c']
my_list=[10,20,30]
arr=np.array([10,20,30])
d={'a':10,'b':20,'c':30}

In [36]:
# ** using lists**

pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [37]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [38]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [39]:
# **dictionary**

pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [40]:
# ### data in a index
ser1=pd.Series([1,2,3,4],index=['USA','Germany','USSR','Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [41]:
ser2= pd.Series([1,2,5,4],index=['USA','Germany','Italy','Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [42]:
ser1['USA']

1

In [43]:
# operations are then also done based off of index:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [44]:
#MISIING DATA
df= pd.DataFrame({'A':[1,2,np.nan],
                 'B':[5,np.nan,np.nan],
                 'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [45]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [46]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [47]:
# thresh takes integer value which tells minimum amount of na values to drop.
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [48]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [49]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [50]:
# GROUP BY
# Create DataFrame
data={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
     'Person':['sam','charlie','Amy','Vanessa','Carl','Sarah'],
     'Sales':[200,120,340,124,243,350]}
df=pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      sam    200
1    GOOG  charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [51]:
df.groupby('Company')

In [52]:
# you can save this object as a new variable:
by_comp=df.groupby("Company")

In [53]:
by_comp

In [54]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [55]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [56]:
#more example of aggregate methods:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [57]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     charlie    120
MSFT         Amy    124

In [58]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     charlie    120
MSFT         Amy    124

In [59]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         sam    200
MSFT     Vanessa    340

In [60]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [61]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [62]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [63]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [64]:
# OPERATIONS
df=pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [65]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [66]:
#pandas nunique()is used to get a count of unique values.
df['col2'].nunique()

3

In [67]:
df ['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [68]:
# select from DataFrame using criteria from multiple columns
newdf= df[(df['col1']>2)&(df['col2']==444)]
newdf

   col1  col2 col3
3     4   444  xyz

In [69]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [70]:
df['col1'].sum()

10

In [73]:
# ** permanently removing a cplumn**

del df['col1']
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [74]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [76]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [77]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [78]:
df.sort_values(by='col2') #inplace= false by default

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [79]:
# ** find null values or check for null values **
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [80]:
# Drop row with NaN values
df.dropna

<bound method DataFrame.dropna of    col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz>

In [81]:
df= pd.DataFrame({'col1':[1,2,3,np.nan],
                 'col2':[np.nan,555,666,444],
                 'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [82]:
df.fillna('FILL')

   col1   col2 col3
0   1.0   FILL  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3  FILL  444.0  xyz

In [86]:
data ={'A':['foo','foo','foo','bar','bar','bar'],
      'B':['one','one','two','two','one','one'],
      'C':['x','y','x','y','x','y'],
      'D':[1,3,2,5,4,1]}
df=[pd.DataFrame(data)]

In [87]:
df

[     A    B  C  D
 0  foo  one  x  1
 1  foo  one  y  3
 2  foo  two  x  2
 3  bar  two  y  5
 4  bar  one  x  4
 5  bar  one  y  1]